{
    "cannotFindDefine": "Cannot find the DEFINE clause for this entity.",
    "cannotFindEntity": "Cannot find this entity or it is ambigous.",
    "circularTypeRef": "Circular type reference found.",
    "emptyParameterName": "The parameter name cannot be empty.",
    "entityHasNoChildren": "This entity has no children.",
    "entityNotUnique": "The name must be unique.",
    "entityOutside": "This entity is outside any DEFINE.",
    "entityStartNameNotUnique": "The first four characters of the name must be unique.",
    "identStringTooLong": "The ident string has a maximum length of 31 characters.",
    "imageStringTooLong": "The image-string is a maximum of 63 characters.",
    "invalidParameterName": "The parameter name must be in the form Pn, where n is the position of the parameter.",
    "invalidParameterNumber": "The parameter names must be numbered consecutively from P1 to P8.",
    "mutualDefaultOrRequired": "The DEFAULT clause and the REQUIRED clause are mutually exclusive.",
    "mutualImageOrRoutine": "Only one ROUTINE or IMAGE clause is allowed.",
    "mutualQual": "The NOQUALIFIERS clause and the QUALIFIER clause are mutually exclusive.",
    "mutualDisallow": "The NODISALLOWS clause and the DISALLOW clause are mutually exclusive.",
    "mutualParameter": "The NOPARAMETERS clause and the PARAMETER clause are mutually exclusive.",
    "nameTooLong": "The name is a maximum of 31 characters.",
    "parameterPromptTooLong": "The parameter prompt is a maximum of 31 characters.",
    "parameterValueDefaultStringTooLong": "The parameter default value is a maximum of 94 characters.",
    "syntaxNotExists": "There is no SYNTAX with this name.",
    "tooManyKeywords": "You can specify up to 255 keywords in a DEFINE TYPE statement.",
    "tooManyLabels": "Too many labels.",
    "tooManyQualifiers": "You can use the QUALIFIER clause up to 255 times in one DEFINE statement.",
    "tooManyTypes": "Too many types.",
    "typeNotExists": "There is no TYPE with this name."
}