* This program demonstrates the use of RMS special registers to

IDENTIFICATION 
 DIVISION.
* Comment 1
* Comment 2
PROGRAM-ID. 
    RMSSPECREGS 
    IS COMMON PROGRAM
    WITH IDENT "RMS SPEC REGS".
AUTHOR. Me and all my
    friends!
* Comment 3
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
END PROGRAM RMSSPECREGS.